tutorials/AhmedBody/constant/thermalProperties
/*--------------------------------*- C++ -*---------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  v1812                                 | 
|   \  /    A nd           | Web:      www.OpenFOAM.com                      | 
|    \/     M anipulation  |                                                 | 
\*--------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

C
{
    type        uniform;
    value       434.000000;
}

k
{
    type        uniform;
    value       60.500000;
}

alpha
{
    type        uniform;
    value       1.100000e-05;
}

thermalStress   false;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
